results/blogPost/benchclient1/quarkus-io-thread-80000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.173ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.166ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.152ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.155ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms  554.16us   4.10ms   65.58%
    Req/Sec    21.12k     1.37k   26.22k    70.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.57ms
 90.000%    1.93ms
 99.000%    2.56ms
 99.900%    3.03ms
 99.990%    3.42ms
 99.999%    3.74ms
100.000%    4.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.051     0.000000            1         1.00
       0.482     0.100000       399315         1.11
       0.672     0.200000       799782         1.25
       0.831     0.300000      1198722         1.43
       0.984     0.400000      1597286         1.67
       1.144     0.500000      1996389         2.00
       1.226     0.550000      2195351         2.22
       1.309     0.600000      2394138         2.50
       1.394     0.650000      2593952         2.86
       1.481     0.700000      2794796         3.33
       1.572     0.750000      2994033         4.00
       1.620     0.775000      3092920         4.44
       1.671     0.800000      3192526         5.00
       1.726     0.825000      3292667         5.71
       1.786     0.850000      3392609         6.67
       1.853     0.875000      3492257         8.00
       1.890     0.887500      3542099         8.89
       1.930     0.900000      3591951        10.00
       1.973     0.912500      3641419        11.43
       2.021     0.925000      3691243        13.33
       2.077     0.937500      3742082        16.00
       2.107     0.943750      3766282        17.78
       2.141     0.950000      3791551        20.00
       2.179     0.956250      3816400        22.86
       2.221     0.962500      3840736        26.67
       2.271     0.968750      3866084        32.00
       2.297     0.971875      3877733        35.56
       2.329     0.975000      3890665        40.00
       2.363     0.978125      3902803        45.71
       2.403     0.981250      3915223        53.33
       2.449     0.984375      3927585        64.00
       2.475     0.985938      3933835        71.11
       2.505     0.987500      3940253        80.00
       2.537     0.989062      3946458        91.43
       2.573     0.990625      3952572       106.67
       2.615     0.992188      3958800       128.00
       2.639     0.992969      3961872       142.22
       2.665     0.993750      3964975       160.00
       2.695     0.994531      3968210       182.86
       2.727     0.995313      3971217       213.33
       2.765     0.996094      3974406       256.00
       2.787     0.996484      3975982       284.44
       2.811     0.996875      3977526       320.00
       2.837     0.997266      3978994       365.71
       2.869     0.997656      3980575       426.67
       2.905     0.998047      3982125       512.00
       2.925     0.998242      3982942       568.89
       2.945     0.998437      3983679       640.00
       2.973     0.998633      3984494       731.43
       2.999     0.998828      3985226       853.33
       3.033     0.999023      3986014      1024.00
       3.053     0.999121      3986430      1137.78
       3.075     0.999219      3986807      1280.00
       3.099     0.999316      3987189      1462.86
       3.127     0.999414      3987587      1706.67
       3.159     0.999512      3987969      2048.00
       3.175     0.999561      3988149      2275.56
       3.197     0.999609      3988354      2560.00
       3.217     0.999658      3988557      2925.71
       3.241     0.999707      3988742      3413.33
       3.269     0.999756      3988931      4096.00
       3.287     0.999780      3989025      4551.11
       3.307     0.999805      3989121      5120.00
       3.329     0.999829      3989221      5851.43
       3.353     0.999854      3989319      6826.67
       3.383     0.999878      3989422      8192.00
       3.399     0.999890      3989462      9102.22
       3.425     0.999902      3989514     10240.00
       3.445     0.999915      3989560     11702.86
       3.467     0.999927      3989611     13653.33
       3.499     0.999939      3989657     16384.00
       3.517     0.999945      3989682     18204.44
       3.535     0.999951      3989707     20480.00
       3.563     0.999957      3989733     23405.71
       3.583     0.999963      3989756     27306.67
       3.599     0.999969      3989780     32768.00
       3.605     0.999973      3989792     36408.89
       3.619     0.999976      3989804     40960.00
       3.635     0.999979      3989815     46811.43
       3.661     0.999982      3989827     54613.33
       3.687     0.999985      3989840     65536.00
       3.715     0.999986      3989846     72817.78
       3.725     0.999988      3989852     81920.00
       3.741     0.999989      3989859     93622.86
       3.753     0.999991      3989864    109226.67
       3.781     0.999992      3989870    131072.00
       3.795     0.999993      3989873    145635.56
       3.807     0.999994      3989876    163840.00
       3.811     0.999995      3989879    187245.71
       3.833     0.999995      3989882    218453.33
       3.855     0.999996      3989885    262144.00
       3.869     0.999997      3989888    291271.11
       3.869     0.999997      3989888    327680.00
       3.881     0.999997      3989891    374491.43
       3.881     0.999998      3989891    436906.67
       3.915     0.999998      3989894    524288.00
       3.915     0.999998      3989894    582542.22
       3.915     0.999998      3989894    655360.00
       3.917     0.999999      3989895    748982.86
       3.933     0.999999      3989896    873813.33
       3.937     0.999999      3989897   1048576.00
       3.937     0.999999      3989897   1165084.44
       3.937     0.999999      3989897   1310720.00
       3.941     0.999999      3989898   1497965.71
       3.941     0.999999      3989898   1747626.67
       3.979     1.000000      3989899   2097152.00
       3.979     1.000000      3989899   2330168.89
       3.979     1.000000      3989899   2621440.00
       3.979     1.000000      3989899   2995931.43
       3.979     1.000000      3989899   3495253.33
       4.107     1.000000      3989900   4194304.00
       4.107     1.000000      3989900          inf
#[Mean    =        1.184, StdDeviation   =        0.554]
#[Max     =        4.104, Total count    =      3989900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4795017 requests in 1.00m, 237.79MB read
Requests/sec:  79918.23
Transfer/sec:      3.96MB