results/blogPost/benchclient1/quarkus-io-thread-80000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.206ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.213ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.199ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.203ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms  565.12us   4.20ms   65.79%
    Req/Sec    21.11k     1.40k   26.56k    69.31%
  4795096 requests in 1.00m, 237.79MB read
Requests/sec:  79918.06
Transfer/sec:      3.96MB