results/blogPost/benchclient1/quarkus-worker-pool-10000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.105ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.110ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.100ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.099ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.10ms  504.26us   8.66ms   64.11%
    Req/Sec     2.64k   327.45     4.22k    81.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.06ms
 75.000%    1.47ms
 90.000%    1.77ms
 99.000%    2.32ms
 99.900%    2.87ms
 99.990%    4.40ms
 99.999%    7.77ms
100.000%    8.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.138     0.000000            1         1.00
       0.471     0.100000        49957         1.11
       0.618     0.200000        99758         1.25
       0.756     0.300000       149886         1.43
       0.899     0.400000       199546         1.67
       1.058     0.500000       249374         2.00
       1.141     0.550000       274399         2.22
       1.222     0.600000       299363         2.50
       1.304     0.650000       324324         2.86
       1.386     0.700000       349321         3.33
       1.471     0.750000       374328         4.00
       1.515     0.775000       386681         4.44
       1.560     0.800000       399117         5.00
       1.607     0.825000       411604         5.71
       1.657     0.850000       423937         6.67
       1.711     0.875000       436465         8.00
       1.742     0.887500       442806         8.89
       1.774     0.900000       448892        10.00
       1.810     0.912500       455175        11.43
       1.850     0.925000       461366        13.33
       1.896     0.937500       467645        16.00
       1.922     0.943750       470794        17.78
       1.951     0.950000       473880        20.00
       1.983     0.956250       476928        22.86
       2.019     0.962500       480097        26.67
       2.063     0.968750       483265        32.00
       2.087     0.971875       484785        35.56
       2.115     0.975000       486369        40.00
       2.145     0.978125       487909        45.71
       2.179     0.981250       489459        53.33
       2.217     0.984375       490976        64.00
       2.239     0.985938       491745        71.11
       2.267     0.987500       492562        80.00
       2.295     0.989062       493321        91.43
       2.331     0.990625       494081       106.67
       2.369     0.992188       494884       128.00
       2.393     0.992969       495285       142.22
       2.419     0.993750       495643       160.00
       2.449     0.994531       496027       182.86
       2.483     0.995313       496411       213.33
       2.525     0.996094       496810       256.00
       2.549     0.996484       497005       284.44
       2.575     0.996875       497202       320.00
       2.607     0.997266       497386       365.71
       2.649     0.997656       497592       426.67
       2.701     0.998047       497783       512.00
       2.721     0.998242       497872       568.89
       2.753     0.998437       497974       640.00
       2.783     0.998633       498068       731.43
       2.823     0.998828       498165       853.33
       2.875     0.999023       498263      1024.00
       2.905     0.999121       498310      1137.78
       2.937     0.999219       498362      1280.00
       2.981     0.999316       498411      1462.86
       3.025     0.999414       498457      1706.67
       3.069     0.999512       498505      2048.00
       3.093     0.999561       498529      2275.56
       3.133     0.999609       498554      2560.00
       3.181     0.999658       498578      2925.71
       3.247     0.999707       498602      3413.33
       3.407     0.999756       498627      4096.00
       3.477     0.999780       498639      4551.11
       3.577     0.999805       498651      5120.00
       3.869     0.999829       498663      5851.43
       4.023     0.999854       498675      6826.67
       4.303     0.999878       498688      8192.00
       4.351     0.999890       498694      9102.22
       4.455     0.999902       498700     10240.00
       4.587     0.999915       498707     11702.86
       4.723     0.999927       498712     13653.33
       5.051     0.999939       498718     16384.00
       5.411     0.999945       498721     18204.44
       5.511     0.999951       498724     20480.00
       6.363     0.999957       498727     23405.71
       6.707     0.999963       498730     27306.67
       7.263     0.999969       498733     32768.00
       7.395     0.999973       498735     36408.89
       7.451     0.999976       498736     40960.00
       7.603     0.999979       498738     46811.43
       7.663     0.999982       498739     54613.33
       7.687     0.999985       498741     65536.00
       7.735     0.999986       498742     72817.78
       7.735     0.999988       498742     81920.00
       7.767     0.999989       498743     93622.86
       7.855     0.999991       498744    109226.67
       7.991     0.999992       498745    131072.00
       7.991     0.999993       498745    145635.56
       7.991     0.999994       498745    163840.00
       8.279     0.999995       498746    187245.71
       8.279     0.999995       498746    218453.33
       8.567     0.999996       498747    262144.00
       8.567     0.999997       498747    291271.11
       8.567     0.999997       498747    327680.00
       8.567     0.999997       498747    374491.43
       8.567     0.999998       498747    436906.67
       8.663     0.999998       498748    524288.00
       8.663     1.000000       498748          inf
#[Mean    =        1.100, StdDeviation   =        0.504]
#[Max     =        8.656, Total count    =       498748]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599433 requests in 1.00m, 52.59MB read
Requests/sec:   9990.12
Transfer/sec:      0.88MB